In [1]:
import pandas as pd

In [7]:
s = pd.Series([71,83,73,77,90,98,33,45,66])

In [9]:
s

0    71
1    83
2    73
3    77
4    90
5    98
6    33
7    45
8    66
dtype: int64

In [11]:
type(s)

pandas.core.series.Series

In [13]:
s2 = pd.Series([71,83,73,77,90,98,33,45,66], index = ['mohammad', 'abdullah', 'ali', 'choton', 'sijan', 'dina', 'edul', 'pappu', 'hanan'])

In [15]:
s2

mohammad    71
abdullah    83
ali         73
choton      77
sijan       90
dina        98
edul        33
pappu       45
hanan       66
dtype: int64

In [18]:
s2['dina']

98

In [20]:
data = {
    "name": ["Alice", "Bob", "Charlie"],
    "age": [25, 30, 35],
    "city": ["Delhi", "Mumbai", "Bangalore"]
}

In [22]:
pd.DataFrame(data)

      name  age       city
0    Alice   25      Delhi
1      Bob   30     Mumbai
2  Charlie   35  Bangalore

In [24]:
df = pd.DataFrame(data)

In [26]:
df

      name  age       city
0    Alice   25      Delhi
1      Bob   30     Mumbai
2  Charlie   35  Bangalore

In [28]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [30]:
df.columns

Index(['name', 'age', 'city'], dtype='object')